{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "# Chapter 4: Just Enough RDF\n",
    "\n",
    "## Basic capabilities of RDFLib\n",
    "\n",
    "This initial part of the chapter is focused on exploring main capabilities of RDFLib to deal with RDF ans semantic information. In that sense, we have defined three bbasic function required for opening and printing semantic information: "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "import rdflib\n",
    "from rdflib import ConjunctiveGraph, URIRef, Graph, Literal\n",
    "from rdflib.namespace import FOAF, RDF\n",
    "from rdflib_sqlalchemy.store import SQLAlchemy\n",
    "from rdflib import Namespace\n",
    "\n",
    "def getGraph(url, strLang):\n",
    "    graph = ConjunctiveGraph()\n",
    "    if strLang == None:\n",
    "        graph.parse(url)\n",
    "    else:\n",
    "        graph.parse(url, format=strLang)\n",
    "    return graph\n",
    "\n",
    "def printTriples (graph):\n",
    "    for triple in graph:\n",
    "        print (triple)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Based on this function, we initially will collect \"Collins\" information from the web"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('http://semprog.com/people/colin'), rdflib.term.URIRef('http://xmlns.com/foaf/0.1/knows'), rdflib.term.URIRef('http://kiwitobes.com/toby.rdf#ts'))\n(rdflib.term.URIRef('http://kiwitobes.com/toby.rdf#ts'), rdflib.term.URIRef('http://xmlns.com/foaf/0.1/mbox'), rdflib.term.URIRef('mailto:toby@segaran.com'))\n(rdflib.term.BNode('N2089fc7c85794078b43a39f0bc7c8d7e'), rdflib.term.URIRef('http://xmlns.com/foaf/0.1/name'), rdflib.term.Literal('Jamie Taylor'))\n(rdflib.term.URIRef('http://semprog.com/people/colin'), rdflib.term.URIRef('http://xmlns.com/foaf/0.1/knows'), rdflib.term.BNode('N2089fc7c85794078b43a39f0bc7c8d7e'))\n(rdflib.term.URIRef('http://kiwitobes.com/toby.rdf#ts'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://xmlns.com/foaf/0.1/Person'))\n(rdflib.term.BNode('N2089fc7c85794078b43a39f0bc7c8d7e'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://xmlns.com/foaf/0.1/Person'))\n(rdflib.term.URIRef('http://semprog.com/people/colin'), rdflib.term.URIRef('http://xmlns.com/foaf/0.1/mbox'), rdflib.term.URIRef('mailto:colin@metaweb.com'))\n(rdflib.term.URIRef('http://semprog.com/people/colin'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://xmlns.com/foaf/0.1/Person'))\n(rdflib.term.BNode('N2089fc7c85794078b43a39f0bc7c8d7e'), rdflib.term.URIRef('http://xmlns.com/foaf/0.1/mbox'), rdflib.term.URIRef('mailto:jamie@semprog.com'))\n(rdflib.term.URIRef('http://semprog.com/people/colin'), rdflib.term.URIRef('http://xmlns.com/foaf/0.1/name'), rdflib.term.Literal('Colin Evans'))\n(rdflib.term.URIRef('http://kiwitobes.com/toby.rdf#ts'), rdflib.term.URIRef('http://xmlns.com/foaf/0.1/name'), rdflib.term.Literal('Toby Segaran'))\n"
     ]
    }
   ],
   "source": [
    "g = getGraph(\"https://raw.githubusercontent.com/agnantis/semantic.o/master/semantico/data/colin.nt\", \"nt\")\n",
    "printTriples(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "As the reader can see, all information are in form of triples. That means, in form of <subject, object , predicate>. Considering simple queries filtering (later we will see SPARQL for querying), we will get all people who knows Collin: "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(rdflib.term.URIRef('http://semprog.com/people/colin'),\n  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/knows'),\n  rdflib.term.URIRef('http://kiwitobes.com/toby.rdf#ts')),\n (rdflib.term.URIRef('http://semprog.com/people/colin'),\n  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/knows'),\n  rdflib.term.BNode('N2089fc7c85794078b43a39f0bc7c8d7e'))]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "list(g.triples((None, FOAF.knows, None)))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Another interesting aspect is to serialize the different graphs in different languages. for that, we will use the \"writeGraph\" function: "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "outfile = open(\"colin.xml\", \"w\")\n",
    "outfile.write(str(g.serialize(format=\"pretty-xml\").decode('utf-8')))\n",
    "outfile.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now, we will see the difference between the serialized and in memory graphs to demonstrate that there is not any difference between graph information: "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "b'@prefix ns1: <http://xmlns.com/foaf/0.1/> .\\n@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\\n@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\\n@prefix xml: <http://www.w3.org/XML/1998/namespace> .\\n@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\\n\\n<http://semprog.com/people/colin> a ns1:Person ;\\n    ns1:knows [ a ns1:Person ;\\n            ns1:mbox <mailto:jamie@semprog.com> ;\\n            ns1:name \"Jamie Taylor\" ],\\n        <http://kiwitobes.com/toby.rdf#ts> ;\\n    ns1:mbox <mailto:colin@metaweb.com> ;\\n    ns1:name \"Colin Evans\" .\\n\\n<http://kiwitobes.com/toby.rdf#ts> a ns1:Person ;\\n    ns1:mbox <mailto:toby@segaran.com> ;\\n    ns1:name \"Toby Segaran\" .\\n\\n'"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "newg = getGraph(\"colin.xml\",None)\n",
    "newg.serialize(format=\"n3\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now, we will see if the both graphs are the same. For that, we will substract both graphs:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "4"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "newg -= g\n",
    "len (newg)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "False"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.isomorphic(newg)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add Triples into the Graph\n",
    "This part is focused on showing how to add triples into a graph. For that, we need to use the \"add\" function of a graph. In that case, we will add in the Colling graph information about us: \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(rdflib.term.URIRef('http://semprog.com/people/colin'),\n  rdflib.term.URIRef('http://xmlns.com/foaf/0.1/knows'),\n  rdflib.term.URIRef('http://my.uri.com/robert'))]"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "me = URIRef(\"http://my.uri.com/robert\")\n",
    "g.add ((me, RDF.type, FOAF.Person))\n",
    "g.add ((URIRef(\"http://semprog.com/people/colin\"), FOAF.knows, me))\n",
    "list(g.triples((None, FOAF.knows, me)))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Persisting Semantic Data\n",
    "\n",
    "For persisting semantic data we need to install RDFLib-SQLAlquemy in order to store semantic data in MySQL or PostgreSQL as many other options. Once installed, we need to enable a database an store the corresponding triples:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "store = SQLAlchemy(configuration=\"postgresql://aitor:1234@localhost:32769\")\n",
    "gPersistent = Graph(store, identifier=URIRef(\"rdflib_test\"))\n",
    "gPersistent.open(\"postgresql://aitor:1234@localhost:32769\", create=True)\n",
    "semprog = rdflib.Namespace(\"http://semprog.com/people/\")\n",
    "foaf = rdflib.Namespace(\"http://xmlns.com/foaf/0.1/\")\n",
    "gPersistent.add((semprog[\"jamie\"], foaf[\"name\"], Literal(\"Jamie Taylor\")))\n",
    "gPersistent.add((semprog[\"jamie\"], foaf[\"mbox\"], Literal(\"jamie@semprog.com\")))\n",
    "gPersistent.serialize(format=\"nt\")  # just to check our work\n",
    "gPersistent.commit()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Once stored the information, we will cconsume stored information as follows: "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "b'<http://semprog.com/people/jamie> <http://xmlns.com/foaf/0.1/name> \"Jamie Taylor\" .\\n<http://semprog.com/people/jamie> <http://xmlns.com/foaf/0.1/mbox> \"jamie@semprog.com\" .\\n\\n'"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "store.open(\"postgresql://aitor:1234@localhost:32769\", create=False)\n",
    "readg= rdflib.ConjunctiveGraph(store)\n",
    "readg.serialize(format=\"nt\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Using SPARQL in RDFLib\n",
    "\n",
    "To underestand how to use SPARQL queries in RDF LIb, we will perform a series of SELECT, CONSTRUCT, ASK queries ilustrated in the book. \n",
    "\n",
    "### 1. Getting al films and release year.\n",
    "\n",
    "To get all films with the release llear we need to find the following triple: \n",
    "\n",
    "<fimlms, fb:film.film.initial_release_date, years>\n",
    "\n",
    "This transferred to SPARQL means: \n",
    "```\n",
    "SELECT ?film ?year\n",
    "WHERE{\n",
    "  film fb:film.film.initial_release_date ?year.\n",
    "}\n",
    "``` "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [],
   "source": [
    "FBNAMESPACE = Namespace(\"http://rdf.freebase.com/ns/\")\n",
    "g = ConjunctiveGraph()\n",
    "g.parse(\"moviedata.n3\", format=\"n3\")\n",
    "results = g.query(\"\"\"SELECT ?film ?year\n",
    "    WHERE { ?film fb:film.film.initial_release_date ?year. }\"\"\", \\\n",
    "                      initNs={'fb': FBNAMESPACE})\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "As a result, we get all films and their corresponding release date. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('http://rdf.freebase.com/ns/en.hollywood_homicide'), rdflib.term.Literal('2003'))\n(rdflib.term.URIRef('http://rdf.freebase.com/ns/en.becoming_dick'), rdflib.term.Literal('2000'))\n(rdflib.term.URIRef('http://rdf.freebase.com/ns/en.the_weight_of_water_2002'), rdflib.term.Literal('2002'))\n(rdflib.term.URIRef('http://rdf.freebase.com/ns/en.k_19_the_widowmaker'), rdflib.term.Literal('2002'))\n(rdflib.term.URIRef('http://rdf.freebase.com/ns/en.body_of_lies'), rdflib.term.Literal('2008'))\n"
     ]
    }
   ],
   "source": [
    "printTriples(results)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. Creating a graph regarding when the actors where employed\n",
    "\n",
    "The idea of this query is to evaluate the use of the CONSTRUCT queries. Based on that, we will use the following query: \n",
    "\n",
    "```\n",
    "CONSTRUCT{\n",
    "  ?who <http://employment.history/was_employed_in> ?year\n",
    "}\n",
    "WHERE{\n",
    "  ?film fb:film.film.starring ?who .\n",
    "  ?film fb:film.film.initial_release_date ?year .\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "b'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<rdf:RDF\\n   xmlns:ns1=\"http://employment.history/\"\\n   xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\"\\n>\\n  <rdf:Description rdf:about=\"http://rdf.freebase.com/ns/en.mark_strong\">\\n    <ns1:was_employed_in>2008</ns1:was_employed_in>\\n  </rdf:Description>\\n  <rdf:Description rdf:about=\"http://rdf.freebase.com/ns/en.joss_ackland\">\\n    <ns1:was_employed_in>2002</ns1:was_employed_in>\\n  </rdf:Description>\\n  <rdf:Description rdf:about=\"http://rdf.freebase.com/ns/en.elizabeth_hurley\">\\n    <ns1:was_employed_in>2002</ns1:was_employed_in>\\n  </rdf:Description>\\n  <rdf:Description rdf:about=\"http://rdf.freebase.com/ns/en.sean_penn\">\\n    <ns1:was_employed_in>2002</ns1:was_employed_in>\\n  </rdf:Description>\\n  <rdf:Description rdf:about=\"http://rdf.freebase.com/ns/en.robert_wagner\">\\n    <ns1:was_employed_in>2003</ns1:was_employed_in>\\n    <ns1:was_employed_in>2000</ns1:was_employed_in>\\n  </rdf:Description>\\n  <rdf:Description rdf:about=\"http://rdf.freebase.com/ns/en.harrison_ford\">\\n    <ns1:was_employed_in>2002</ns1:was_employed_in>\\n    <ns1:was_employed_in>2003</ns1:was_employed_in>\\n  </rdf:Description>\\n  <rdf:Description rdf:about=\"http://rdf.freebase.com/ns/en.russell_crowe\">\\n    <ns1:was_employed_in>2008</ns1:was_employed_in>\\n  </rdf:Description>\\n  <rdf:Description rdf:about=\"http://rdf.freebase.com/ns/en.bob_saget\">\\n    <ns1:was_employed_in>2000</ns1:was_employed_in>\\n  </rdf:Description>\\n  <rdf:Description rdf:about=\"http://rdf.freebase.com/ns/en.kurupt\">\\n    <ns1:was_employed_in>2003</ns1:was_employed_in>\\n  </rdf:Description>\\n</rdf:RDF>\\n'"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = g.query(\"\"\"CONSTRUCT {\n",
    "?who <http://employment.history/was_employed_in> ?year }\n",
    "WHERE {\n",
    "?film fb:film.film.starring ?who .\n",
    "?film fb:film.film.initial_release_date ?year .\n",
    "}\"\"\", initNs={'fb':FBNAMESPACE}).serialize(format=\"xml\")\n",
    "\n",
    "results"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 3. Getting all films released after 2005\n",
    "\n",
    "In this query, we will make us of the FILTER query. In that sense, the following query will be performed: \n",
    "\n",
    "```\n",
    "SELECT ?film ?year\n",
    "WHERE{\n",
    "?film fb:film.film.initial_release_date ?year .\n",
    "FILTER (?year > \"2005\")\n",
    "}\n",
    "``` "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('http://rdf.freebase.com/ns/en.body_of_lies'), rdflib.term.Literal('2008'))\n"
     ]
    }
   ],
   "source": [
    "results = g.query(\"\"\"\n",
    "Select ?film ?year where{ ?film fb:film.film.initial_release_date ?year . FILTER (?year > \"2005\") }\"\"\", \\\n",
    "                      initNs={'fb': FBNAMESPACE})\n",
    "\n",
    "printTriples(results)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 4. Paginating the queries results\n",
    "\n",
    "This example will be focused on ordering and paginating the query results when there exist in the query numerous results. As an example, if we want to make the pagination over the following query:\n",
    "```\n",
    "SELECT ?name ?year \n",
    "WHERE{\n",
    "  ?movie fb:film.film.initial_release_date ?year . \n",
    "  ?movie fb:film.film.starring ?actor .\n",
    "  ?actor fb:type.object.name ?name . \n",
    "}\n",
    "```\n",
    "\n",
    "Initially we need to Order the query results: "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.Literal('Bob Saget'), rdflib.term.Literal('2000'))\n(rdflib.term.Literal('Robert Wagner'), rdflib.term.Literal('2000'))\n(rdflib.term.Literal('Elizabeth Hurley'), rdflib.term.Literal('2002'))\n(rdflib.term.Literal('Harrison Ford'), rdflib.term.Literal('2002'))\n(rdflib.term.Literal('Sean Penn'), rdflib.term.Literal('2002'))\n(rdflib.term.Literal('Harrison Ford'), rdflib.term.Literal('2003'))\n(rdflib.term.Literal('Kurupt'), rdflib.term.Literal('2003'))\n(rdflib.term.Literal('Robert Wagner'), rdflib.term.Literal('2003'))\n(rdflib.term.Literal('Mark Strong'), rdflib.term.Literal('2008'))\n(rdflib.term.Literal('Russell Crowe'), rdflib.term.Literal('2008'))\n"
     ]
    }
   ],
   "source": [
    "results = g.query(\"\"\"\n",
    "Select ?name ?year where{ ?movie fb:film.film.initial_release_date ?year . \n",
    "?movie fb:film.film.starring ?actor . \n",
    "?actor fb:type.object.name ?name .} ORDER BY ?year ?name\"\"\", \\\n",
    "                      initNs={'fb': FBNAMESPACE})\n",
    "\n",
    "printTriples(results)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now, if we wnat to paginate the queries, qe need to make use of the LIMIT and OFFSET query options:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "---- page: 1----\n(rdflib.term.URIRef('http://rdf.freebase.com/ns/en.becoming_dick'), rdflib.term.Literal('2000'))\n(rdflib.term.URIRef('http://rdf.freebase.com/ns/en.the_weight_of_water_2002'), rdflib.term.Literal('2002'))\n---- page: 2----\n(rdflib.term.URIRef('http://rdf.freebase.com/ns/en.k_19_the_widowmaker'), rdflib.term.Literal('2002'))\n(rdflib.term.URIRef('http://rdf.freebase.com/ns/en.hollywood_homicide'), rdflib.term.Literal('2003'))\n---- page: 3----\n(rdflib.term.URIRef('http://rdf.freebase.com/ns/en.body_of_lies'), rdflib.term.Literal('2008'))\n---- page: 4----\n"
     ]
    }
   ],
   "source": [
    "limit = 2\n",
    "page = 0\n",
    "results = True\n",
    "\n",
    "while results:\n",
    "    print (\"---- page: \" + str(page+1) + \"----\")\n",
    "    results = g.query(\"\"\"PREFIX fb:<http://rdf.freebase.com/ns/> \n",
    "    SELECT ?film ?year\n",
    "    WHERE { ?film fb:film.film.initial_release_date ?year. \n",
    "    } ORDER BY ?year LIMIT \"\"\" + str(limit) + \" OFFSET \" + str((page*limit)))\n",
    "    \n",
    "    for triple in results: \n",
    "        print (triple)\n",
    "    page += 1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "As we can see, the results are divided in different pages. This kind of queries are really usefuk where huge amount of information is being queried. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
